In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:

df = pd.read_csv("../datasets/Players.csv")
# Take a look at the first few rows
df.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [18]:

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3189 entries, 1 to 3919
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   3189 non-null   int64
 1   Player       3189 non-null   object
 2   height       3189 non-null   int64
 3   weight       3189 non-null   int64
 4   collage      3189 non-null   object
 5   born         3189 non-null   int64
 6   birth_city   3189 non-null   object
 7   birth_state  3189 non-null   object
dtypes: int64(4), object(4)
memory usage: 224.2+ KB

In [4]:
df.describe()

        Unnamed: 0       height       weight        born
count  3922.000000  3921.000000  3921.000000  3921.00000
mean   1960.500000   198.704922    94.783219  1962.37975
std    1132.328206     9.269761    12.039515    20.33491
min       0.000000   160.000000    60.000000  1913.00000
25%     980.250000   190.000000    86.000000  1948.00000
50%    1960.500000   198.000000    95.000000  1964.00000
75%    2940.750000   206.000000   102.000000  1979.00000
max    3921.000000   231.000000   163.000000  1997.00000

In [19]:
df['birth_city']
df['birth_city'].isnull()

1       False
4       False
6       False
7       False
8       False
        ...
3915    False
3916    False
3917    False
3918    False
3919    False
Name: birth_city, Length: 3189, dtype: bool

In [6]:
cnt=0
for row in df['birth_city']:
    try:
        int(row)
        df.loc[cnt, 'birth_city']=np.isnan
    except ValueError:
        pass
    cnt+=1

In [20]:
df['birth_city'].isnull()

1       False
4       False
6       False
7       False
8       False
        ...
3915    False
3916    False
3917    False
3918    False
3919    False
Name: birth_city, Length: 3189, dtype: bool

In [8]:
print(df

      Unnamed: 0             Player  height  weight  \
0              0    Curly Armstrong   180.0    77.0
1              1       Cliff Barker   188.0    83.0
2              2      Leo Barnhorst   193.0    86.0
3              3         Ed Bartels   196.0    88.0
4              4        Ralph Beard   178.0    79.0
...          ...                ...     ...     ...
3917        3917      Troy Williams   198.0    97.0
3918        3918       Kyle Wiltjer   208.0   108.0
3919        3919  Stephen Zimmerman   213.0   108.0
3920        3920        Paul Zipser   203.0    97.0
3921        3921        Ivica Zubac   216.0   120.0

                              collage    born      birth_city  \
0                  Indiana University  1918.0             NaN
1              University of Kentucky  1921.0        Yorktown
2            University of Notre Dame  1924.0             NaN
3     North Carolina State University  1925.0             NaN
4              University of Kentucky  1927.0     Hardinsburg
...                               ...     ...             ...
3917  South Carolina State University  1969.0        Columbia
3918               Gonzaga University  1992.0        Portland
3919  University of Nevada, Las Vegas  1996.0  Hendersonville
3920                              NaN  1994.0      Heidelberg
3921                              NaN  1997.0          Mostar

                 birth_state
0                        NaN
1                    Indiana
2                        NaN
3                        NaN
4                   Kentucky
...                      ...
3917          South Carolina
3918                  Oregon
3919               Tennessee
3920                 Germany
3921  Bosnia and Herzegovina

[3922 rows x 8 columns]

In [9]:
df.dropna(subset = ["birth_state"], inplace=True)

In [10]:
print(df)

      Unnamed: 0             Player  height  weight  \
1              1       Cliff Barker   188.0    83.0
4              4        Ralph Beard   178.0    79.0
6              6      Charlie Black   196.0    90.0
7              7        Nelson Bobb   183.0    77.0
8              8    Jake Bornheimer   196.0    90.0
...          ...                ...     ...     ...
3917        3917      Troy Williams   198.0    97.0
3918        3918       Kyle Wiltjer   208.0   108.0
3919        3919  Stephen Zimmerman   213.0   108.0
3920        3920        Paul Zipser   203.0    97.0
3921        3921        Ivica Zubac   216.0   120.0

                              collage    born      birth_city  \
1              University of Kentucky  1921.0        Yorktown
4              University of Kentucky  1927.0     Hardinsburg
6                University of Kansas  1921.0            Arco
7                   Temple University  1924.0    Philadelphia
8                  Muhlenberg College  1927.0   New Brunswick
...                               ...     ...             ...
3917  South Carolina State University  1969.0        Columbia
3918               Gonzaga University  1992.0        Portland
3919  University of Nevada, Las Vegas  1996.0  Hendersonville
3920                              NaN  1994.0      Heidelberg
3921                              NaN  1997.0          Mostar

                 birth_state
1                    Indiana
4                   Kentucky
6                      Idaho
7               Pennsylvania
8                 New Jersey
...                      ...
3917          South Carolina
3918                  Oregon
3919               Tennessee
3920                 Germany
3921  Bosnia and Herzegovina

[3439 rows x 8 columns]

In [11]:
df.dropna(subset = ["birth_city"], inplace=True)

In [12]:
print(df)

      Unnamed: 0             Player  height  weight  \
1              1       Cliff Barker   188.0    83.0
4              4        Ralph Beard   178.0    79.0
6              6      Charlie Black   196.0    90.0
7              7        Nelson Bobb   183.0    77.0
8              8    Jake Bornheimer   196.0    90.0
...          ...                ...     ...     ...
3917        3917      Troy Williams   198.0    97.0
3918        3918       Kyle Wiltjer   208.0   108.0
3919        3919  Stephen Zimmerman   213.0   108.0
3920        3920        Paul Zipser   203.0    97.0
3921        3921        Ivica Zubac   216.0   120.0

                              collage    born      birth_city  \
1              University of Kentucky  1921.0        Yorktown
4              University of Kentucky  1927.0     Hardinsburg
6                University of Kansas  1921.0            Arco
7                   Temple University  1924.0    Philadelphia
8                  Muhlenberg College  1927.0   New Brunswick
...                               ...     ...             ...
3917  South Carolina State University  1969.0        Columbia
3918               Gonzaga University  1992.0        Portland
3919  University of Nevada, Las Vegas  1996.0  Hendersonville
3920                              NaN  1994.0      Heidelberg
3921                              NaN  1997.0          Mostar

                 birth_state
1                    Indiana
4                   Kentucky
6                      Idaho
7               Pennsylvania
8                 New Jersey
...                      ...
3917          South Carolina
3918                  Oregon
3919               Tennessee
3920                 Germany
3921  Bosnia and Herzegovina

[3439 rows x 8 columns]

In [13]:
df.dropna(subset = ["collage"], inplace=True)

In [14]:
print(df)

      Unnamed: 0             Player  height  weight  \
1              1       Cliff Barker   188.0    83.0
4              4        Ralph Beard   178.0    79.0
6              6      Charlie Black   196.0    90.0
7              7        Nelson Bobb   183.0    77.0
8              8    Jake Bornheimer   196.0    90.0
...          ...                ...     ...     ...
3915        3915        Okaro White   203.0    92.0
3916        3916   Isaiah Whitehead   193.0    96.0
3917        3917      Troy Williams   198.0    97.0
3918        3918       Kyle Wiltjer   208.0   108.0
3919        3919  Stephen Zimmerman   213.0   108.0

                              collage    born      birth_city     birth_state
1              University of Kentucky  1921.0        Yorktown         Indiana
4              University of Kentucky  1927.0     Hardinsburg        Kentucky
6                University of Kansas  1921.0            Arco           Idaho
7                   Temple University  1924.0    Philadelphia    Pennsylvania
8                  Muhlenberg College  1927.0   New Brunswick      New Jersey
...                               ...     ...             ...             ...
3915         Florida State University  1992.0      Clearwater         Florida
3916            Seton Hall University  1995.0        Brooklyn        New York
3917  South Carolina State University  1969.0        Columbia  South Carolina
3918               Gonzaga University  1992.0        Portland          Oregon
3919  University of Nevada, Las Vegas  1996.0  Hendersonville       Tennessee

[3189 rows x 8 columns]

In [15]:
df[['height', 'weight','born']] = df[['height','weight','born']].astype('int')

In [16]:
print(df)

      Unnamed: 0             Player  height  weight  \
1              1       Cliff Barker     188      83
4              4        Ralph Beard     178      79
6              6      Charlie Black     196      90
7              7        Nelson Bobb     183      77
8              8    Jake Bornheimer     196      90
...          ...                ...     ...     ...
3915        3915        Okaro White     203      92
3916        3916   Isaiah Whitehead     193      96
3917        3917      Troy Williams     198      97
3918        3918       Kyle Wiltjer     208     108
3919        3919  Stephen Zimmerman     213     108

                              collage  born      birth_city     birth_state
1              University of Kentucky  1921        Yorktown         Indiana
4              University of Kentucky  1927     Hardinsburg        Kentucky
6                University of Kansas  1921            Arco           Idaho
7                   Temple University  1924    Philadelphia    Pennsylvania
8                  Muhlenberg College  1927   New Brunswick      New Jersey
...                               ...   ...             ...             ...
3915         Florida State University  1992      Clearwater         Florida
3916            Seton Hall University  1995        Brooklyn        New York
3917  South Carolina State University  1969        Columbia  South Carolina
3918               Gonzaga University  1992        Portland          Oregon
3919  University of Nevada, Las Vegas  1996  Hendersonville       Tennessee

[3189 rows x 8 columns]